from collections import Counter


entry_record = ['이싸피', '박장고', '조실습', '이싸피', '조실습', '오디비', '임온실', '조실습', '조실습', '이싸피', '안도둑', '임온실', '최이썬', '오디비', '안도둑', '염자바', '박장고', '조실습',
                '최이썬', '조실습', '염자바', '박장고', '임온실', '임온실', '이싸피', '임온실', '오디비', '조실습', '염자바', '임온실', '박장고', '최이썬', '안도둑', '염자바', '임온실', '박장고', '이싸피', '안도둑',
                '임온실', '오디비', '최이썬', '안도둑', '이싸피', '오디비', '안도둑', '이싸피', '박장고', '박장고', '안도둑', '안도둑', '안도둑', '염자바', '최이썬', '오디비', '오디비', '최이썬', '이싸피', '임온실', '안도둑']

exit_record = ['최이썬', '조실습', '이싸피', '안도둑', '임온실', '안도둑', '이싸피', '오디비', '염자바', '박장고', '최이썬', '이싸피', '염자바', '염자바', '박장고', '임온실', '이싸피',
               '박장고', '안도둑', '염자바', '이싸피', '조실습', '조실습', '임온실', '박장고', '이싸피', '조실습', '박장고', '오디비', '안도둑', '조실습', '임온실', '안도둑', '안도둑', '임온실', '조실습', '최이썬', '안도둑', '임온실',
               '염자바', '이싸피', '임온실', '안도둑', '오디비', '안도둑', '오디비', '임온실', '염자바', '임온실', '박장고', '조실습', '이싸피', '최이썬', '최이썬', '오디비', '오디비', '염자바', '오디비', '안도둑', '박장고']


entry_count = Counter(entry_record) #Counter({'안도둑': 10, '임온실': 9, '이싸피': 8, '박장고': 7, '조실습': 7, '오디비': 7, '최이썬': 6, '염자바': 5})
exit_count = Counter(exit_record) #Counter({'안도둑': 10, '임온실': 9, '이싸피': 8, '조실습': 7, '오디비': 7, '염자바': 7, '박장고': 7, '최이썬': 5})

# 딕셔너리를 오름차순으로 정렬 
entry_count1 = dict(sorted(entry_count.items(), key=lambda x : x[1])) #{'염자바': 5, '최이썬': 6, '박장고': 7, '조실습': 7, '오디비': 7, '이싸피': 8, '임온실': 9, '안도둑': 10}
exit_count1 = dict(sorted(exit_count.items(), key=lambda x : x[1])) #{'최이썬': 5, '조실습': 7, '오디비': 7, '염자바': 7, '박장고': 7, '이싸피': 8, '임온실': 9, '안도둑': 10}




# 튜플을 담은 리스트로 변환 
entry_count2 = []
exit_count2 = []

for key,value in entry_count1.items(): #[('염자바', 5), ('최이썬', 6), ('박장고', 7), ('조실습', 7), ('오디비', 7), ('이싸피', 8), ('임온실', 9), ('안도둑', 10)]
    entry_count2.append((key, value))

for key,value in exit_count1.items(): #[('최이썬', 5), ('조실습', 7), ('오디비', 7), ('염자바', 7), ('박장고', 7), ('이싸피', 8), ('임온실', 9), ('안도둑', 10)]
    exit_count2.append((key, value))

# 입장기록 탑 3
print(f'''
입장 기록 많은 Top3
{entry_count2[-1][0]} {entry_count2[-1][1]}회
{entry_count2[-2][0]} {entry_count2[-2][1]}회
{entry_count2[-3][0]} {entry_count2[-3][1]}회
''', end = '\n')

# 출입기록 수상한 사람 
thief_list = []
for key in entry_count1.keys():
    diff_ee = entry_count1[key] - exit_count1[key] # 출입의 차
    if diff_ee != 0 : # 출입의 차가 0이 아니면 
        thief_list.append((key,diff_ee))

print(f'출입 기록이 수상한 사람')
for info in thief_list[::-1]:
    if info[1] > 0:
        print(f'{info[0]}은 입장 기록이 {info[1]}회 더 많아 수상합니다.')
    elif info[1] < 0:
        print(f'{info[0]}은 퇴장 기록이 {-info[1]}회 더 많아 수상합니다.')




